import pandas as pd
import os.path



File_Path = f"D:\\User\\Desktop\\Dynamic_Programming\\DP2.xlsx"

if os.path.isfile(File_Path):
    print("  File Found  " + File_Path)
    df = pd.read_excel(File_Path, sheet_name = "DP").to_dict('list')
    print(df)

else:
    print("404 NOT FOUND")         



{0: {0: {'餐點': '石鍋拌飯,叻沙牛肉麵', '整體滿意度': 169, '價格': 300}, 1: {'餐點': '花生雞腿堡,叻沙牛肉麵', '整體滿意度': 160, '價格': 289}, 2: {'餐點': '原汁牛肉麵,叻沙牛肉麵', '整體滿意度': 158, '價格': 275}, 3: {'餐點': '魷魚羹,叻沙牛肉麵', '整體滿意度': 148, '價格': 230}, 4: {'餐點': '功夫麵,叻沙牛肉麵', '整體滿意度': 143, '價格': 225}}, 
1: {0: {'餐點': '叻沙牛肉麵,石鍋拌飯', '整體滿意度': 169, '價格': 300}, 1: {'餐點': '花生雞腿堡,石鍋拌飯', '整體滿意度': 149, '價格': 269}, 2: {'餐點': '原汁牛肉麵,石鍋拌飯', '整體滿意度': 147, '價格': 255}, 3: {'餐點': '魷魚羹,石鍋拌飯', '整體滿意度': 137, '價格': 210}, 4: {'餐點': '功夫麵,石鍋拌飯', '整體滿意度': 132, '價格': 205}}, 
2: {0: {'餐點': '叻沙牛肉麵,花生雞腿堡', '整體滿意度': 160, '價格': 289}, 1: {'餐點': '石鍋拌飯,花生雞腿堡', '整體滿意度': 149, '價格': 269}, 2: {' 餐點': '原汁牛肉麵,花生雞腿堡', '整體滿意度': 138, '價格': 244}, 3: {'餐點': '魷魚羹,花生雞腿堡', '整體滿意度': 128, '價格': 199}, 4: {'餐點': '功夫麵,花生雞腿堡', '整體滿意度': 123, '價格': 194}}, 
3: {0: {'餐點': '叻沙牛肉麵,原汁牛肉麵', '整體滿意度': 158, '價格': 275}, 1: {'餐點': '石鍋拌飯,原汁牛肉麵', '整體滿意度': 147, '價格': 255}, 2: {'餐點': '花生雞腿堡,原汁牛肉麵', '整體滿意度': 138, '價格': 244}, 3: {'餐點': '魷魚羹,原汁牛肉麵', '整體滿意度': 126, '價格': 185}, 4: {'餐點': '功夫麵,原汁牛肉麵', '整體滿意度': 121, '價格': 180}}, 
4: {0: {'餐點': '叻沙牛肉麵,魷魚羹', '整體滿意度': 148, '價格': 230}, 1: {'餐點': '石鍋拌飯,魷魚羹', '整體滿意度': 137, '價格': 210}, 2: {'餐點': '花生雞腿堡,魷魚羹', '整體滿意度': 128, '價格': 199}, 3: {'餐點': '原汁牛肉麵,魷魚羹', '整體滿意度': 126, '價格': 185}, 4: {'餐點': '功夫麵,魷魚羹', '整體滿意度': 111, '價格': 135}}, 
5: {0: {'餐點': '叻沙牛肉麵,功夫麵', '整體滿意度': 143, '價格': 225}, 1: {'餐點': '石鍋拌飯,功夫麵', '整體滿意度': 132, '價格': 205}, 2: {'餐點': '花生雞腿堡,功夫麵', '整體滿意度': 123, '價格': 194}, 3: {'餐點': '原汁牛肉麵,功夫麵', '整體滿意度': 121, '價格': 180}, 4: {'餐點': '魷魚羹,功夫麵', '整體滿意度': 111, '價格': 135}}}


{3: {0: {'餐點': '叻沙牛肉麵', '整體滿意度': 90, '價格': 160}, 1: {'餐點': '石鍋拌飯', '整體滿意度': 79, '價格': 140}, 2: {'餐點': '花生雞腿堡', '整體滿意度': 70, '價格': 129}, 3: {'餐點': '原汁牛肉麵', '整體滿意度': 68, '價格': 115}, 4: {'餐點': '魷魚羹', '整體滿意度': 58, '價格': 70}, 5: {'餐點': '功夫麵', '整體滿意度': 53, '價格': 65}}, 
2: {0: {'餐點': '石鍋拌飯,叻沙牛肉麵', '整體滿意度': 169, '價格': 300}, 1: {'餐點': ' 叻沙牛肉麵,石鍋拌飯', '整體滿意度': 169, '價格': 300}, 2: {'餐點': '叻沙牛肉麵,花生雞腿堡', '整體滿意度': 160, '價格': 289}, 3: {'餐點': '叻沙牛肉麵,原汁牛肉麵', '整體滿意度': 158, '價格': 275}, 4: {'餐點': '叻沙牛肉麵,魷魚羹', '整體滿意度': 148, '價格': 230}, 5: {'餐點': '叻沙牛肉麵,功夫麵', '整體滿意度': 143, '價格': 225}}, 
1: {0: {'餐點': '花生雞腿堡,石鍋拌飯,叻沙牛肉麵', '整體滿意度': 239, '價格': 429}, 1: {'餐點': '花生雞腿堡,叻沙牛肉麵,石鍋拌飯', '整體滿意度': 239, '價格': 429}, 2: {'餐點': '石鍋拌飯,叻沙牛肉麵,花生雞腿堡', '整體滿意度': 239, '價格': 429}, 3: {'餐點': '石鍋拌飯,叻沙牛肉麵,原汁牛肉麵', '整體滿意度': 237, '價格': 415}, 4: {'餐點': '石鍋拌飯,叻沙牛肉麵,魷魚羹', '整體滿意度': 227, '價格': 370}, 5: {'餐點': '石鍋拌飯,叻沙牛肉麵,功夫麵', '整體滿意度': 222, '價格': 365}}}
